---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DoorFinish
source: html/13f970ca-f0cd-32a6-aece-400bd50fce10.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DoorFinish Property

"Finish"

## Syntax (C#)
```csharp
public static ForgeTypeId DoorFinish { get; }
```